a = int(input("Введіть невід'ємне ціле число a: "))  # a - не від'ємне ціле число
b = int(input("Введіть додатне ціле число b: "))  # b - додатне число b
if (not b > 0) or (a<0):
    print("Неправильний ввід числа!")
    exit(1)
r = float(input("Введіть довільне число r: "))  # r-довільне число
s = float(input("Введіть довільне число s: "))  # s-додатне число
remainder = a % b  # Остача від ділення a на b

if r == s and remainder == s:
    print("Остача від ділення a на b дорівнює r (r=s).")
elif remainder == s:
    print("Остача від ділення a на b дорівнює s.")
elif remainder == r:
    print("Остача від ділення a на b дорівнює r.")
else:
    print("Остача від ділення a на b не дорівнює r і не дорівнює s.")